app/controllers/photos_controller.rb

  def show
    @comments = Postcomment.where(photo_id: @photo.id)
    @images = Image.where(photo_id: @photo.id)
---
SELECT "postcomments".* FROM "postcomments" WHERE "postcomments"."photo_id" = ?  [["photo_id", 9]]
SELECT "images".* FROM "images" WHERE "images"."photo_id" = ?  [["photo_id", 9]]