app/controllers/postcomments_controller.rb

INSERT INTO "postcomments" ("text", "photo_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Чотка"], ["photo_id", 9], ["user_id", 3], ["created_at", "2017-12-20 13:16:06.372001"], ["updated_at", "2017-12-20 13:16:06.372001"]]
---
def create
params[:postcomment][:photo_id] = params[:photo_id]
params[:postcomment][:user_id] = current_user.id
@comment = Postcomment.create(postcomments_params)